### Terraform Plan: `dev/app`
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.base: Reading...
module.compute.data.aws_ami.ubuntu_arm64: Reading...
module.compute.data.aws_ami.ubuntu_x86: Reading...
module.compute.aws_iam_role.ec2_ssm: Refreshing state... [id=doktori-nonprod-ec2-ssm]
module.compute.aws_iam_role_policy_attachment.ssm_managed: Refreshing state... [id=doktori-nonprod-ec2-ssm-20260218101158840700000002]
module.compute.aws_iam_role_policy.ec2_ecr_pull: Refreshing state... [id=doktori-nonprod-ec2-ssm:doktori-nonprod-ec2-ecr-pull]
module.compute.aws_iam_role_policy.ec2_parameter_store: Refreshing state... [id=doktori-nonprod-ec2-ssm:doktori-nonprod-ec2-ssm-params]
module.compute.aws_iam_role_policy.ec2_s3_access[0]: Refreshing state... [id=doktori-nonprod-ec2-ssm:doktori-nonprod-ec2-s3]
module.compute.aws_iam_instance_profile.ec2_ssm: Refreshing state... [id=doktori-nonprod-ec2-ssm]
module.compute.data.aws_ami.ubuntu_arm64: Read complete after 0s [id=ami-067069a366ec13118]
module.compute.data.aws_ami.ubuntu_x86: Read complete after 1s [id=ami-04d25ae66444b2b10]
data.terraform_remote_state.base: Read complete after 2s
module.compute.aws_eip.this["dev_app"]: Refreshing state... [id=eipalloc-00bcea5929af03c0b]
module.compute.aws_security_group.this["dev_ai"]: Refreshing state... [id=sg-021c5fb789b65e267]
module.compute.aws_security_group.this["dev_app"]: Refreshing state... [id=sg-03b1c919b105986b0]
module.compute.aws_security_group_rule.cross["dev_ai-from-dev_app-8000"]: Refreshing state... [id=sgrule-2665117030]
module.compute.aws_instance.this["dev_app"]: Refreshing state... [id=i-03b97221a77062a1d]
module.compute.aws_instance.this["dev_ai"]: Refreshing state... [id=i-05d9f4a85e06c241c]
module.compute.aws_eip_association.this["dev_app"]: Refreshing state... [id=eipassoc-00fb4ebd3a8201874]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.service["dev_ai"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ai.dev.doktori.internal"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z08439973IDNFFVG0N43A"
    }

  # aws_route53_record.service["dev_app"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "app.dev.doktori.internal"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z08439973IDNFFVG0N43A"
    }

  # module.compute.aws_eip.this["dev_app"] will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"    = "doktori-nonprod-dev-app-eip"
          + "Service" = "dev_app"
        }
      + tags_all             = {
          + "Environment" = "nonprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-nonprod-dev-app-eip"
          + "Project"     = "doktori"
          + "Service"     = "dev_app"
        }
      + vpc                  = (known after apply)
    }

  # module.compute.aws_eip_association.this["dev_app"] will be created
  + resource "aws_eip_association" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.compute.aws_instance.this["dev_ai"] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-067069a366ec13118"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "doktori-nonprod-ec2-ssm"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "doktori-dev"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-05621a464006280c3"
      + tags                                 = {
          + "AutoStop"    = "true"
          + "Environment" = "dev"
          + "Name"        = "doktori-nonprod-dev-ai"
          + "Part"        = "ai"
          + "Service"     = "ai"
        }
      + tags_all                             = {
          + "AutoStop"    = "true"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-nonprod-dev-ai"
          + "Part"        = "ai"
          + "Project"     = "doktori"
          + "Service"     = "ai"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-021c5fb789b65e267",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # module.compute.aws_instance.this["dev_app"] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-067069a366ec13118"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "doktori-nonprod-ec2-ssm"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "doktori-dev"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-05621a464006280c3"
      + tags                                 = {
          + "AutoStop"    = "true"
          + "Environment" = "dev"
          + "Name"        = "doktori-nonprod-dev-app"
          + "Part"        = "cloud"
          + "Service"     = "app"
        }
      + tags_all                             = {
          + "AutoStop"    = "true"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-nonprod-dev-app"
          + "Part"        = "cloud"
          + "Project"     = "doktori"
          + "Service"     = "app"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-03b1c919b105986b0",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 60
          + volume_type           = "gp3"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ compute = {
      ~ eip_public_ips     = {
          ~ dev_app = "13.209.183.40" -> (known after apply)
        }
      ~ instance_ids       = {
          ~ dev_ai  = "i-05d9f4a85e06c241c" -> (known after apply)
          ~ dev_app = "i-03b97221a77062a1d" -> (known after apply)
        }
      ~ private_ips        = {
          ~ dev_ai  = "10.0.1.160" -> (known after apply)
          ~ dev_app = "10.0.1.149" -> (known after apply)
        }
        # (1 unchanged attribute hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```